%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Стартовая программа для демонстрации случайных %
% блужданий %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
n =500; % Число частиц
dh =.02; % Параметр случайного распределения
% Задание вектор-столбцов координат точек
y =1:n;
y=y'; x =zeros(size(y));
h=plot(x,y,'k.'); % Вывод начального положения точек
axis([-2 2 0 n+1 ]); % Задание осей
% Определение режима перерисовки и размера точек
set(h,'EraseMode','background','MarkerSize',3);
pause(1); % Пауза для вывода графика на экран
i=0; % Начальное значение

dn=-2:0.05:2;
a=0;
b=0;
ln=line(b,a);
le=line;
nc=0;
while nc < 10000 % neБесконечный цикл
nc=nc+1;
i=i+1;
x=x+dh*(2*rand(n,1)-1); % Случайные смещения x-координаты
% каждой точки
% Смена координат точек на рисунке
set(h,'XData',x,'YData',y,'Color','k');
[a,b] = hist(x,dn);
[a,b] = stairs(a,b);
c = 40*exp(-b.*b/2/nc/dh/dh)/sqrt(2*nc*pi*dh*dh);
set(ln, 'XData', b,'YData',a);
set(le, 'XData', b,'YData',c);
pause(0.1);
end;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%